### portpg: stocks
### stock:  price

### Restart & Run All Cells

In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine1 = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine1.connect()

engine2 = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine2.connect()

pd.set_option('display.float_format','{:,.2f}'.format)

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"

today = date.today()
week_str = today.strftime('%Y-%U')
today, week_str

(datetime.date(2021, 12, 25), '2021-51')

In [2]:
sql = '''
SELECT name, market
FROM stocks
'''
stocks_lite = pd.read_sql(sql, conlite)
stocks_lite

      name  market
0      MCS     SET
1    PTTGC   SET50
2      IVL   SET50
3    JASIF     SET
4       LH   SET50
5      DIF     SET
6    ROJNA     SET
7    NOBLE     SET
8       TU   SET50
9      DCC     SET
10   HREIT     SET
11    MEGA  SET100
12     JMT  SET100
13    GULF   SET50
14   TISCO   SET50
15     SIS     SET
16     TQM  SET100
17     STA   SET50
18   RATCH   SET50
19     SCC   SET50
20     NER     SET
21   SYNEX  SET100
22     BCH  SET100
23  DOHOME  SET100
24     PTT   SET50
25     RJH     SET
26  SINGER  SET100
27     KCE   SET50
28     EPG     SET
29     SAT     SET
30   KBANK   SET50
31     VNT     SET
32   BGRIM   SET50
33     TMT     SET
34   STARK     SET
35     RCL     SET
36    TYCN     SET
37      IP     mai
38     BLA     SET
39     CKP  SET100
40   SPALI  SET100
41     SVI     SET
42     TOP   SET50
43     TSE     SET
44  GLOBAL   SET50
45     PTL  SET100
46    TSTH     SET
47     ASK     SET
48     IMH     mai
49     TKS     SET
50    TCAP

In [3]:
sql = '''
SELECT name, market, id
FROM stocks
'''
stocks_pg = pd.read_sql(sql, conpg)
stocks_pg.shape[0]

356

In [4]:
df_merge = pd.merge(stocks_lite, stocks_pg, on='name', how='inner')
df_merge.shape[0]

51

In [5]:
set50 = df_merge.market_y.str.contains('SET50')
filter_50 = df_merge[set50].copy()
filter_50['market_x'] = 'SET50'
filter_50.sort_values(by=['name'],ascending=[True])

      name market_x                                       market_y   id
32   BGRIM    SET50                  SET50 / SETCLMV / SETTHSI       63
44  GLOBAL    SET50                    SET50 / SETCLMV / SETWB      198
13    GULF    SET50                  SET50 / SETCLMV / SETTHSI      207
2      IVL    SET50                            SET50 / SETTHSI      238
30   KBANK    SET50                  SET50 / SETCLMV / SETTHSI      253
27     KCE    SET50                                      SET50      256
4       LH    SET50                              SET50 / SETHD      275
24     PTT    SET50          SET50 / SETCLMV / SETHD / SETTHSI      389
1    PTTGC    SET50                  SET50 / SETCLMV / SETTHSI      391
18   RATCH    SET50          SET50 / SETCLMV / SETHD / SETTHSI      399
19     SCC    SET50          SET50 / SETCLMV / SETHD / SETTHSI      433
17     STA    SET50                    SET50 / SETTHSI / SETWB      489
14   TISCO    SET50                    SET50 / SETHD / SETTHSI      539
42     TOP    SET50                  SET50 / SETCLMV / SETTHSI      564
8       TU    SET50  SET50 / SETCLMV / SETHD / SETTHSI / SETWB      591

In [6]:
set100 = df_merge.market_y.str.contains('SET100')
filter_100 = df_merge[set100].copy()
filter_100['market_x'] = 'SET100'
filter_100.sort_values(by=['name'],ascending=[True])

      name market_x                        market_y   id
22     BCH   SET100              SET100 / SETWB       55
39     CKP   SET100  SET100 / SETCLMV / SETTHSI      110
23  DOHOME   SET100              SET100 / SETWB      670
12     JMT   SET100                      SET100      245
11    MEGA   SET100    SET100 / SETCLMV / SETWB      303
45     PTL   SET100                      SET100      388
26  SINGER   SET100                      SET100      452
40   SPALI   SET100    SET100 / SETHD / SETTHSI      470
21   SYNEX   SET100            SET100 / SETTHSI      504
50    TCAP   SET100              SET100 / SETHD      512
16     TQM   SET100                      SET100      664

In [7]:
setmai = df_merge.market_y.str.contains('mai')
filter_mai = df_merge[setmai].copy()
filter_mai['market_x'] = 'mai'
filter_mai.sort_values(by=['name'],ascending=[True])

   name market_x market_y   id
48  IMH      mai  mai      706
37   IP      mai  mai      713

In [8]:
filter_set = df_merge[~(set100 | set50 | setmai)].copy()
filter_set['market_x'] = 'SET'
filter_set.sort_values(by=['name'],ascending=[True])

     name market_x                      market_y   id
47    ASK      SET                      sSET       42
38    BLA      SET                       SET       73
9     DCC      SET                       SET      140
5     DIF      SET                       SET      146
28    EPG      SET                       SET      166
10  HREIT      SET                       SET      217
3   JASIF      SET                       SET      241
0     MCS      SET                      sSET      301
20    NER      SET                      sSET      651
7   NOBLE      SET                      sSET      336
35    RCL      SET                   SETCLMV      401
25    RJH      SET                      sSET      404
6   ROJNA      SET                      sSET      409
29    SAT      SET            sSET / SETTHSI      427
15    SIS      SET                      sSET      455
34  STARK      SET                   SETCLMV      712
41    SVI      SET                       SET      500
49    TKS      SET                      sSET      543
33    TMT      SET                       SET      553
43    TSE      SET                      sSET      582
46   TSTH      SET  sSET / SETCLMV / SETTHSI      587
36   TYCN      SET                       SET      714
31    VNT      SET                       SET      622

In [9]:
filter_all = pd.concat([filter_50, filter_100, filter_mai, filter_set], axis=0)
type(filter_all)

pandas.core.frame.DataFrame

In [10]:
filter_all.to_sql('filter_all', engine1, if_exists='replace')

In [11]:
sql = '''
UPDATE stocks
  SET
    market = (SELECT filter_all.market_x FROM filter_all WHERE filter_all.name = stocks.name)
'''
rp = conlite.execute(sql)
rp.rowcount

51